# Lesson 2: Manipulation of data

**LEARNING OBJECTIVES:**

1. Learn how to do simple calculations to whole columns at a time
2. Continue what we learnt in Lesson 1
3. Learn how to sort columns in order
4. Understand what a pivot table does and how do make one

**Column Operations**

Firstly, as always we need to import the `pandas` library. Once again we are giving it a nickname of `pd`.

In [1]:
import pandas as pd

We are starting this lesson where we left off on lesson 1 with the `PrisonsData` DataFrame object.

In [2]:
PrisonsData = pd.read_csv(
    "https://raw.githubusercontent.com/ThomasJewson/datasets/master/PrisonsDataFull.csv"
)

Lets output the `PrisonsData` DataFrame object by calling its name.

In [3]:
PrisonsData

  Prison Name  Capacity  Population  Rating
0   Altcourse      1164        1131       3
1     Bedford       441         351       1
2     Cardiff       779         718       2

With the `pandas` library we can do mathematical functions on the columns by using the usual mathematical operators `+`,`-`,`*` and `/`.

A useful thing to know about our data on UK prisons would be the number of empty space in each prison. This can be calculated by subtracting the data from the `Capacity` column by the `Population` column data. 

As we learnt in lesson 1, we can select data from specific columns. For example, if we wanted to output the data from the `Capacity` column we would use the following command `PrisonsData["Capacity"]`.

Therefore, to find the number of spaces in each prison we would do the following:

In [4]:
PrisonSpaces = PrisonsData["Capacity"] - PrisonsData["Population"]

PrisonSpaces # Outputting what we have calculated.

0    33
1    90
2    61
dtype: int64

Now to insert this data back into the original `PrisonsData` DataFrame, we will use what we learnt in lesson 1.

We want the `PrisonSpaces` data to be next to the `Population` column. Therefore we want to give our new column a column index of 3.

In [5]:
PrisonsData.insert(
    3,                  # Column index
    "Spaces",           # Column label
    PrisonSpaces        # Data
)

And outputting the DataFrame we get the following:

In [6]:
PrisonsData

  Prison Name  Capacity  Population  Spaces  Rating
0   Altcourse      1164        1131      33       3
1     Bedford       441         351      90       1
2     Cardiff       779         718      61       2

**Sorting DataFrames**

We can sort the DataFrames from smallest to largest or vice versa with the `.sort_values()` function.

For example, if we want to sort the `PrisonsData` DataFrame by the prison's data.

In [7]:
PrisonsData.sort_values("Rating")

  Prison Name  Capacity  Population  Spaces  Rating
1     Bedford       441         351      90       1
2     Cardiff       779         718      61       2
0   Altcourse      1164        1131      33       3

We can reverse the order of this sorting by adding `ascending=False` as an argument in the `.sort_values()` function.

In [8]:
PrisonsData.sort_values("Rating",ascending=False)

  Prison Name  Capacity  Population  Spaces  Rating
0   Altcourse      1164        1131      33       3
2     Cardiff       779         718      61       2
1     Bedford       441         351      90       1

We can even sort the DataFrame in alphabetical or anti-alphabetical order of the `Prison Name` column.

In [9]:
PrisonsData.sort_values("Prison Name",ascending=False) 
# Anti-alphabetical ordering of the "Prisons Name" column

  Prison Name  Capacity  Population  Spaces  Rating
2     Cardiff       779         718      61       2
1     Bedford       441         351      90       1
0   Altcourse      1164        1131      33       3

**Pivot Tables**

Lets start this section with some new data.

In [10]:
CarShop = pd.read_csv(
    "https://raw.githubusercontent.com/ThomasJewson/datasets/master/CarShop.csv"
)
CarShop

  Product    Brand  Quantity  Total Price
0   Turbo       VW         1          362
1     Oil       VW         1           34
2    Tyre       VW         4          196
3    Tyre       VW         1           49
4   Turbo  Renault         2          724
5     Oil  Renault         1           34
6    Tyre  Renault         2           98

Above we have `CarShop` which is a DataFrame which has a series of sales from a car part shop. 

If you were running the business it would be very beneficial for you if you could group the types of products together to see the total sales of Oil, Turbos and Tyres. 

This rearrangement of the table is called pivoting. For example, below we are pivoting the table about the `Product` column by using the  `index=["Product"]` argument.

![Pivot Table](https://raw.githubusercontent.com/ThomasJewson/datasets/master/pivottableconversion3.png)

We need to import a new library called `numpy` - which adds a large variety of mathematical functions to our programming suite. In our case, what we need specifically is the `numpy.sum` function. This adds up all the numbers and finds the sum of all the quantities and prices of each individual product. 

Without the `aggfunc=np.sum` argument the function finds the average value.

In [11]:
import numpy as np # np is its nickname

Below is the code to produce the pivot table:

In [14]:
CarShop.pivot_table(
    index=["Product"],              #This is the data we want to pivot from 
    aggfunc=np.sum                  #We want to sum over all data
)

         Quantity  Total Price
Product
Oil             2           68
Turbo           3         1086
Tyre            7          343

We can even pivot the `CarShop` DataFrame about `Product` AND `Brand` columns.

This will seperate out brand of each product sold. The ordering of the index argument is important. Firstly, we want to pivot about the `Brand` column then we want to pivot about the `Product` column therefore we have the argument of `index=["Brand","Product"]`.

In [22]:
CarShop.pivot_table(
    index=["Brand","Product"],              #This is the data we want to pivot from 
    aggfunc=np.sum                  #We want to sum over all data
)

                 Quantity  Total Price
Brand   Product
Renault Oil             1           34
        Turbo           2          724
        Tyre            2           98
VW      Oil             1           34
        Turbo           1          362
        Tyre            5          245

What do you think happens when we reverse the order of the index argument to `index=["Product","Brand"]`? See below.

In [15]:
CarShop.pivot_table(
    index=["Product","Brand"],      #This is the data we want to pivot from 
    aggfunc=np.sum                  #We want to sum over all data
)

                 Quantity  Total Price
Product Brand
Oil     Renault         1           34
        VW              1           34
Turbo   Renault         2          724
        VW              1          362
Tyre    Renault         2           98
        VW              5          245

We can even specify which particular columns we would like to aggregate. For example, if we only wanted to see the `Total Price` we would use the argument `values="Total Price"`. 

Without the `values` argument the function automatically aggregates all the columns in the DataFrame.

In [17]:
CarShop.pivot_table(
    index=["Product","Brand"],      #This is the data we want to pivot from 
    aggfunc=np.sum,                 #We want to sum over all data
    values="Total Price"
)

                 Total Price
Product Brand
Oil     Renault           34
        VW                34
Turbo   Renault          724
        VW               362
Tyre    Renault           98
        VW               245

In [18]:
CarShop.pivot_table(
    index=["Product","Brand"],      #This is the data we want to pivot from 
    aggfunc=np.sum,                 #We want to sum over all data
    values="Quantity"
)

                 Quantity
Product Brand
Oil     Renault         1
        VW              1
Turbo   Renault         2
        VW              1
Tyre    Renault         2
        VW              5

**Conclusions:**

*You should now be able to do the following:*
    
1. Do calculations between columns of a DataFrame by calling columns with square brackets and operating on them
2. Use pivot tables to organise data by using the `.pivot_table()` function.
3. Sort DataFrames with the `.sort_values()` function.

**Optional Extension:**

NOT COMPLETED YET